## Title

> Sources: 
- http://download.inep.gov.br/microdados/microdados_educacao_superior_2018.zip
- http://download.inep.gov.br/informacoes_estatisticas/sinopses_estatisticas/sinopses_educacao_superior/sinopse_educacao_superior_2018.zip

In [1]:
import numpy as np
import pandas as pd
import os
import csv
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sb

## <span style="color:red">DO NOT LOAD THIS DATAFRAME - MOVE TO 'DATA EXPLORATION' SESSION

In [2]:
alunos_df = pd.read_csv('DM_ALUNO.csv', sep='|')

C:\Users\ROLD003\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3051: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
alunos_df.head(10)

,NU_ANO_CENSO,CO_IES,TP_CATEGORIA_ADMINISTRATIVA,TP_ORGANIZACAO_ACADEMICA,CO_CURSO,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,TP_NIVEL_ACADEMICO,...,TP_MOBILIDADE_ACADEMICA,TP_MOBILIDADE_ACADEMICA_INTERN,CO_IES_DESTINO,CO_PAIS_DESTINO,IN_MATRICULA,IN_CONCLUINTE,IN_INGRESSO_TOTAL,IN_INGRESSO_VAGA_NOVA,IN_INGRESSO_PROCESSO_SELETIVO,NU_ANO_INGRESSO
0,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2017
1,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,0,0,0,0,NaN,2016
2,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
3,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,0,0,0,0,NaN,2015
4,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2013
5,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
6,2018,1,1,1,1,NaN,1.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2015
7,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,0,0,0,0,NaN,2017
8,2018,1,1,1,1,NaN,3.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,1,0,0,NaN,2015
9,2018,1,1,1,1,NaN,1.0,1.0,1,1,...,NaN,NaN,NaN,NaN,0,0,0,0,NaN,2013

In [4]:
alunos_df.iloc[:10, 5:15]

,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,TP_NIVEL_ACADEMICO,CO_CINE_ROTULO,ID_ALUNO,CO_ALUNO_CURSO,CO_ALUNO_CURSO_ORIGEM,TP_COR_RACA
0,NaN,3.0,1.0,1,1,0421D01,2ECD7C9BEA7DCEBC31B9F2874D454F71,76445203,NaN,2
1,NaN,3.0,1.0,1,1,0421D01,2A9470AC3FC03AD130954809A84BC7D4,76448482,NaN,3
2,NaN,3.0,1.0,1,1,0421D01,3EA3DF175677D93C4FDD47865E89B92A,76484508,NaN,3
3,NaN,3.0,1.0,1,1,0421D01,E535A93D94430667B67D180C506CCB66,76485260,NaN,2
4,NaN,3.0,1.0,1,1,0421D01,EF1C01E9B84BEB8D6AA9702F59A90410,76449602,NaN,3
5,NaN,3.0,1.0,1,1,0421D01,E92DBC6D54AD8AC7419AC6818C9D4C3B,76471898,NaN,2
6,NaN,1.0,1.0,1,1,0421D01,442253EDCC14C59DA844B46DE6BFC49C,76471899,NaN,3
7,NaN,3.0,1.0,1,1,0421D01,0617FBEA7F8A7FE095AC7A425DB9C365,76484877,NaN,1
8,NaN,3.0,1.0,1,1,0421D01,023771AFF243E3A6682FE1F2E7186C54,76472660,NaN,3
9,NaN,1.0,1.0,1,1,0421D01,1F6DAC46F9DCE74E16573BAD76F51453,76460158,NaN,2

In [5]:
alunos_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12043993 entries, 0 to 12043992
Columns: 105 entries, NU_ANO_CENSO to NU_ANO_INGRESSO
dtypes: float64(62), int64(40), object(3)
memory usage: 9.4+ GB

## Filtrando Medicina

In [6]:
auxiliar_df = pd.read_csv('TB_AUX_CINE_BRASIL.csv', sep='|', encoding='latin-1')
auxiliar_df.head(5)

,CO_CINE_AREA_GERAL,NO_CINE_AREA_GERAL,CO_CINE_AREA_ESPECIFICA,NO_CINE_AREA_ESPECIFICA,CO_CINE_AREA_DETALHADA,NO_CINE_AREA_DETALHADA,CO_CINE_ROTULO,NO_CINE_ROTULO
0,0,Programas básicos,1,Programas básicos,11,Programas básicos,0011A01,ABI Educação
1,0,Programas básicos,1,Programas básicos,11,Programas básicos,0011A02,ABI Artes e humanidades
2,0,Programas básicos,1,Programas básicos,11,Programas básicos,0011A03,"ABI Ciências sociais, jornalismo e informação"
3,0,Programas básicos,1,Programas básicos,11,Programas básicos,0011A04,"ABI Negócios, administração e direito"
4,0,Programas básicos,1,Programas básicos,11,Programas básicos,0011A05,"ABI Ciências naturais, matemática e estatística"

In [7]:
auxiliar_df[auxiliar_df['NO_CINE_ROTULO'] == 'Medicina']

,CO_CINE_AREA_GERAL,NO_CINE_AREA_GERAL,CO_CINE_AREA_ESPECIFICA,NO_CINE_AREA_ESPECIFICA,CO_CINE_AREA_DETALHADA,NO_CINE_AREA_DETALHADA,CO_CINE_ROTULO,NO_CINE_ROTULO
319,9,Saúde e bem-estar,91,Saúde,912,Medicina,0912M01,Medicina

In [8]:
list(alunos_df.IN_MATRICULA.value_counts().index)

[1, 0]

In [9]:
OCDE_med_cod = list(auxiliar_df[auxiliar_df['NO_CINE_ROTULO'] == 'Medicina']['CO_CINE_ROTULO'])
OCDE_med_cod

['0912M01']

In [11]:
medicina_df = alunos_df[alunos_df['CO_CINE_ROTULO'].isin(OCDE_med_cod)]
medicina_df

,NU_ANO_CENSO,CO_IES,TP_CATEGORIA_ADMINISTRATIVA,TP_ORGANIZACAO_ACADEMICA,CO_CURSO,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,TP_NIVEL_ACADEMICO,...,TP_MOBILIDADE_ACADEMICA,TP_MOBILIDADE_ACADEMICA_INTERN,CO_IES_DESTINO,CO_PAIS_DESTINO,IN_MATRICULA,IN_CONCLUINTE,IN_INGRESSO_TOTAL,IN_INGRESSO_VAGA_NOVA,IN_INGRESSO_PROCESSO_SELETIVO,NU_ANO_INGRESSO
3703,2018,1,1,1,12,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
3704,2018,1,1,1,12,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2015
3705,2018,1,1,1,12,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2016
3706,2018,1,1,1,12,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,1,0,0,NaN,2013
3707,2018,1,1,1,12,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12040603,2018,22514,4,3,1408505,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
12040604,2018,22514,4,3,1408505,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
12040605,2018,22514,4,3,1408505,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
12040606,2018,22514,4,3,1408505,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
12040607,2018,22514,4,3,1408505,NaN,4.0,1.0,1,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018

In [12]:
medicina_df.to_csv('medicina_df_2018.csv')

> Comments: salvando um novo arquivo com a base de medicina para otimizar o processamento de dados.

## Data Exploration

In [2]:
loading_medicina = pd.read_csv('medicina_df_2018.csv')

In [20]:
medicina_df = loading_medicina.copy()
medicina_df

,Unnamed: 0,NU_ANO_CENSO,CO_IES,TP_CATEGORIA_ADMINISTRATIVA,TP_ORGANIZACAO_ACADEMICA,CO_CURSO,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,...,TP_MOBILIDADE_ACADEMICA,TP_MOBILIDADE_ACADEMICA_INTERN,CO_IES_DESTINO,CO_PAIS_DESTINO,IN_MATRICULA,IN_CONCLUINTE,IN_INGRESSO_TOTAL,IN_INGRESSO_VAGA_NOVA,IN_INGRESSO_PROCESSO_SELETIVO,NU_ANO_INGRESSO
0,3703,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
1,3704,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2015
2,3705,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2016
3,3706,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,1,0,0,NaN,2013
4,3707,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
177366,12040603,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177367,12040604,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177368,12040605,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177369,12040606,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177370,12040607,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018

In [21]:
medicina_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177371 entries, 0 to 177370
Columns: 106 entries, Unnamed: 0 to NU_ANO_INGRESSO
dtypes: float64(62), int64(41), object(3)
memory usage: 143.4+ MB

In [22]:
medicina_df = medicina_df[medicina_df['IN_MATRICULA'] == 1]
medicina_df

,Unnamed: 0,NU_ANO_CENSO,CO_IES,TP_CATEGORIA_ADMINISTRATIVA,TP_ORGANIZACAO_ACADEMICA,CO_CURSO,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,...,TP_MOBILIDADE_ACADEMICA,TP_MOBILIDADE_ACADEMICA_INTERN,CO_IES_DESTINO,CO_PAIS_DESTINO,IN_MATRICULA,IN_CONCLUINTE,IN_INGRESSO_TOTAL,IN_INGRESSO_VAGA_NOVA,IN_INGRESSO_PROCESSO_SELETIVO,NU_ANO_INGRESSO
0,3703,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
1,3704,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2015
2,3705,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2016
3,3706,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,1,0,0,NaN,2013
4,3707,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
177366,12040603,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177367,12040604,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177368,12040605,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177369,12040606,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177370,12040607,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018

> Comments: validado com a sinopse estatística do ensino superior 2018. Tanto o Censo quanto na Sinopse Estatística trazem 167,788 alunos de Medicina com matrículas ativas.

In [23]:
medicina_df = medicina_df.rename(columns={'Unnamed: 0': 'original_index'})
medicina_df

,original_index,NU_ANO_CENSO,CO_IES,TP_CATEGORIA_ADMINISTRATIVA,TP_ORGANIZACAO_ACADEMICA,CO_CURSO,CO_CURSO_POLO,TP_TURNO,TP_GRAU_ACADEMICO,TP_MODALIDADE_ENSINO,...,TP_MOBILIDADE_ACADEMICA,TP_MOBILIDADE_ACADEMICA_INTERN,CO_IES_DESTINO,CO_PAIS_DESTINO,IN_MATRICULA,IN_CONCLUINTE,IN_INGRESSO_TOTAL,IN_INGRESSO_VAGA_NOVA,IN_INGRESSO_PROCESSO_SELETIVO,NU_ANO_INGRESSO
0,3703,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2012
1,3704,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2015
2,3705,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2016
3,3706,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,1,0,0,NaN,2013
4,3707,2018,1,1,1,12,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,0,0,NaN,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
177366,12040603,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177367,12040604,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177368,12040605,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177369,12040606,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018
177370,12040607,2018,22514,4,3,1408505,NaN,4.0,1.0,1,...,NaN,NaN,NaN,NaN,1,0,1,1,NaN,2018

## Including category names

#### #1 - TP_CATEGORIA_ADMINISTRATIVA

In [24]:
type(medicina_df.TP_CATEGORIA_ADMINISTRATIVA[0])

numpy.int64

In [25]:
list(medicina_df.TP_CATEGORIA_ADMINISTRATIVA.value_counts().index.sort_values())

[1, 2, 3, 4, 5, 7]

In [26]:
list_cat_adm = {1: 'Pública Federal',
                2: 'Pública Estadual',
                3: 'Pública Municipal',
                4: 'Privada com fins lucrativos',
                5: 'Privada sem fins lucrativos',
                6: 'Privada - Particular em sentido estrito',
                7: 'Especial',
                8: 'Privada comunitária',
                9: 'Privada confessional'}

medicina_df['TP_CAT_ADM_NAME'] = medicina_df.apply(lambda x: list_cat_adm[x.TP_CATEGORIA_ADMINISTRATIVA], axis=1)

In [27]:
medicina_df.iloc[:, np.r_[3, 106]].sample(10)

        TP_CATEGORIA_ADMINISTRATIVA              TP_CAT_ADM_NAME
61108                             5  Privada sem fins lucrativos
72144                             5  Privada sem fins lucrativos
101273                            1              Pública Federal
125440                            5  Privada sem fins lucrativos
136530                            4  Privada com fins lucrativos
52301                             5  Privada sem fins lucrativos
99226                             1              Pública Federal
57406                             2             Pública Estadual
74054                             4  Privada com fins lucrativos
37905                             5  Privada sem fins lucrativos

#### #2 - TP_ORGANIZACAO_ACADEMICA

In [28]:
list_org_acad = {1: 'Universidade',
                 2: 'Centro Universitário',
                 3: 'Faculdade',
                 4: 'Instituto Federal de Educação, Ciência e Tecnologia',
                 5: 'Centro Federal de Educação Tecnológica'}

medicina_df['TP_ORG_ACAD_NAME'] = medicina_df.apply(lambda x: list_org_acad[x.TP_ORGANIZACAO_ACADEMICA], axis=1)

In [29]:
medicina_df.iloc[:, np.r_[4, 107]].sample(10)

        TP_ORGANIZACAO_ACADEMICA      TP_ORG_ACAD_NAME
22569                          1          Universidade
74281                          1          Universidade
69980                          3             Faculdade
109337                         1          Universidade
156357                         3             Faculdade
10268                          1          Universidade
24550                          1          Universidade
142071                         2  Centro Universitário
169283                         2  Centro Universitário
75497                          3             Faculdade

#### #3 - TP_SEXO

In [30]:
list_sexo = {1: 'Feminino',
             2: 'Masculino'}

medicina_df['TP_SEX_NAME'] = medicina_df.apply(lambda x: list_sexo[x.TP_SEXO], axis=1)

In [35]:
medicina_df.iloc[:, np.r_[16, 108]].sample(10)

        TP_SEXO TP_SEX_NAME
131894        1    Feminino
36764         1    Feminino
41480         1    Feminino
67699         2   Masculino
9099          1    Feminino
18881         1    Feminino
122130        1    Feminino
40442         1    Feminino
148105        1    Feminino
61857         1    Feminino

#### #4 - TP_NACIONALIDADE

In [48]:
list_nac = {1: 'Brasileira',
            2: 'Brasileira - nascido no exterior ou naturalizado',
            3: 'Estrangeira'}

medicina_df['TP_NAC_NAME'] = medicina_df.apply(lambda x: list_nac[x.TP_NACIONALIDADE], axis=1)

In [61]:
medicina_df.iloc[:, np.r_[21, 109]].sample(10)

        TP_NACIONALIDADE  TP_NAC_NAME
141574                 1   Brasileira
145780                 1   Brasileira
75591                  1   Brasileira
101356                 3  Estrangeira
87475                  1   Brasileira
76191                  1   Brasileira
130029                 1   Brasileira
58551                  1   Brasileira
104657                 1   Brasileira
175119                 1   Brasileira

#### #5 - IN_DEFICIENCIA

In [62]:
list_def = {0: 'Não',
            1: 'Sim',
            9: 'Não dispõe de informação (Não resposta)'}

medicina_df['IN_DEF_NAME'] = medicina_df.apply(lambda x: list_def[x.IN_DEFICIENCIA], axis=1)

In [108]:
medicina_df.iloc[:, np.r_[25, 110]].sample(10)

        IN_DEFICIENCIA                              IN_DEF_NAME
15487                1                                      Sim
53353                0                                      Não
65756                9  Não dispõe de informação (Não resposta)
157948               0                                      Não
62815                0                                      Não
149724               0                                      Não
102713               0                                      Não
152141               0                                      Não
82106                0                                      Não
131447               0                                      Não

#### #6 - TP_SITUACAO

In [109]:
list_sit = {2: 'Cursando',
            3: 'Matrícula trancada',
            4: 'Desvinculado do curso',
            5: 'Transferido para outro curso da mesma IES',
            6: 'Formado',
            7: 'Falecido'}

medicina_df['TP_SIT_NAME'] = medicina_df.apply(lambda x: list_sit[x.TP_SITUACAO], axis=1)

In [169]:
medicina_df.iloc[:, np.r_[39, 111]].sample(10)

        TP_SITUACAO TP_SIT_NAME
143028            2    Cursando
168120            2    Cursando
17270             6     Formado
65950             2    Cursando
120331            2    Cursando
78576             2    Cursando
23146             2    Cursando
8093              2    Cursando
1772              6     Formado
54827             2    Cursando

#### #7 - TP_ESCOLA_CONCLUSAO_ENS_MEDIO

In [170]:
list_escola = {1: 'Pública',
               2: 'Privada',
               9: 'Não dispõe da informação (Não resposta)'}

medicina_df['TP_ESC_ENS_MED_NAME'] = medicina_df.apply(lambda x: list_escola[x.TP_ESCOLA_CONCLUSAO_ENS_MEDIO], axis=1)

In [187]:
medicina_df.iloc[:, np.r_[91, 112]].sample(10)

        TP_ESCOLA_CONCLUSAO_ENS_MEDIO TP_ESC_ENS_MED_NAME
56374                               1             Pública
19012                               2             Privada
83600                               1             Pública
93121                               2             Privada
20121                               2             Privada
134512                              2             Privada
114236                              2             Privada
143715                              2             Privada
135410                              1             Pública
37401                               2             Privada

## Dropping and reordering columns